# vim: ft=ruby

# Taps should be at the top of the Brewfile.

tap "atlassian-labs/acli"
tap "coursier/formulas"
tap "databricks/tap"
tap "sst/tap"

brew "acli"
brew "ast-grep"
brew "azure-cli"
brew "bashdb"
brew "bat"
brew "btop"
brew "checkbashisms"
brew "cloc"
brew "cmatrix"
brew "coreutils" if OS.mac?
brew "coursier/formulas/coursier"
brew "databricks/tap/databricks"
brew "direnv" if OS.mac?
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-filter-repo"
brew "glab"
brew "gnu-sed" if OS.mac?
brew "gnupg"
brew "golang"
brew "graphviz"
brew "hadolint"
brew "hatch"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "maven"
brew "neovim"
brew "node"
brew "pam-reattach" if OS.mac?
brew "pandoc"
brew "parallel"
brew "pinentry-mac" if OS.mac?
brew "pipenv"
brew "poppler"
brew "pre-commit"
brew "protobuf"
brew "python"
brew "resvg"
brew "ripgrep"
brew "rsync"
brew "rust-analyzer"
brew "sd"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "sponge"
brew "sqlcmd"
brew "sst/tap/opencode"
brew "starship"
brew "stow"
brew "terraform-docs"
brew "terragrunt"
brew "tfenv"
brew "tflint"
brew "tlrc"
brew "tmux"
brew "unixodbc"
brew "uv"
brew "wget"
brew "yazi" # opt deps: ffmpeg sevenzip jq poppler fd ripgrep fzf zoxide resvg imagemagick font-symbols-only-nerd-font
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "alacritty"
cask "basictex"
cask "cursor"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "git-credential-manager"
cask "gpg-suite-no-mail"
cask "karabiner-elements"
cask "kitty"
cask "monitorcontrol"
cask "superwhisper"
