tap "coursier/formulas"
tap "databricks/tap"
tap "homebrew/bundle"
brew "ast-grep"
brew "azure-cli"
brew "bashdb"
brew "bat"
brew "btop"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "glab"
brew "gnupg"
brew "graphviz"
brew "hadolint"
brew "hatch"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "maven"
brew "neovim"
brew "node"
brew "pam-reattach"
brew "pandoc"
brew "parallel"
brew "pipx"
brew "pre-commit"
brew "protobuf"
brew "python@3.8"
brew "python@3.9"
brew "python@3.10"
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "ripgrep"
brew "rsync"
brew "rust-analyzer"
brew "sd"
brew "shellcheck"
brew "shfmt"
brew "sponge"
brew "starship"
brew "stow"
brew "terraform-docs"
brew "terragrunt"
brew "tfenv"
brew "tflint"
brew "tlrc"
brew "tmux"
brew "uv"
brew "wget"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "coursier/formulas/coursier"
brew "databricks/tap/databricks"
cask "alacritty"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "git-credential-manager"
cask "karabiner-elements"
cask "obsidian"
