# vim: ft=ruby

# Taps should be at the top of the Brewfile.

tap "anomalyco/tap", trusted: {formula: "opencode"}
tap "atlassian/acli", trusted: {formula: "acli"}
tap "bufbuild/buf", trusted: {formula: "buf"}
tap "coursier/formulas", trusted: {formula: "coursier"}
tap "databricks/tap", trusted: {formula: "databricks"}

brew "anomalyco/tap/opencode"
brew "ast-grep"
brew "atlassian/acli/acli", postinstall: "${HOMEBREW_PREFIX}/bin/acli completion zsh >~/.config/zsh/completions/_acli"
brew "azure-cli"
brew "basedpyright"
brew "bash"
brew "bashdb"
brew "bat", postinstall: "${HOMEBREW_PREFIX}/bin/bat cache --build"
brew "bats-core"
brew "btop"
brew "bufbuild/buf/buf"
brew "chafa"
brew "check-jsonschema"
brew "checkbashisms"
brew "cloc"
brew "cmatrix"
brew "container" if OS.mac?
brew "coursier/formulas/coursier", postinstall: %q[printf '#compdef cs\n\n_cs() {\n  eval "$(cs complete zsh-v1 $CURRENT $words[@])"\n}\n' >~/.config/zsh/completions/_cs]
brew "cowsay"
brew "databricks/tap/databricks"
brew "direnv" if OS.mac?
brew "docker-compose"
brew "duckdb"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "git-delta"
brew "git-filter-repo"
brew "gitleaks", postinstall: "${HOMEBREW_PREFIX}/bin/gitleaks completion zsh >~/.config/zsh/completions/_gitleaks"
brew "glab", postinstall: "${HOMEBREW_PREFIX}/bin/glab skills install --path ~/.claude/skills --force"
brew "gnupg"
brew "golang"
brew "graphviz"
brew "hadolint"
brew "hatch"
brew "hyperfine"
brew "imagemagick"
brew "jless"
brew "jnv"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "markdownlint-cli2"
brew "marp-cli"
brew "maven"
brew "mermaid-cli"
brew "metals"
brew "mypy"
brew "neovim"
brew "node"
brew "pam-reattach" if OS.mac?
brew "pandoc"
brew "parallel"
brew "pinentry-mac" if OS.mac?
brew "pipenv"
brew "poppler"
brew "powershell"
brew "prek"
brew "prettier"
brew "protobuf"
brew "python"
brew "resvg"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "rustup", postinstall: "${HOMEBREW_PREFIX}/bin/rustup completions zsh cargo >~/.config/zsh/completions/_cargo"
brew "sd"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "speedtest-cli"
brew "sponge"
brew "sqlcmd"
brew "sqlite"
brew "starship"
brew "stow"
brew "taplo"
brew "termshot"
brew "terraform-docs"
brew "terragrunt"
brew "tfenv", postinstall: "curl -L https://raw.githubusercontent.com/ohmyzsh/ohmyzsh/master/plugins/terraform/_terraform -o ~/.config/zsh/completions/_terraform"
brew "tflint"
brew "tlrc"
brew "tmux"
brew "tokei"
brew "tree-sitter-cli"
brew "ty"
brew "unixodbc"
brew "uv"
brew "wget"
brew "yazi" # opt deps: ffmpeg sevenzip jq poppler fd ripgrep fzf zoxide resvg imagemagick font-symbols-only-nerd-font
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# GNU over BSD
brew "coreutils" if OS.mac?
brew "findutils" if OS.mac?
brew "gnu-sed" if OS.mac?
brew "gnu-tar" if OS.mac?
brew "grep" if OS.mac?

cask "alacritty"
cask "basictex"
cask "claude"
cask "claude-code"
cask "crystalfetch"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "gpg-suite-no-mail"
cask "intellij-idea"
cask "karabiner-elements"
cask "kitty"
cask "libreoffice"
cask "maccy"
cask "monitorcontrol"
cask "podman-desktop", postinstall: "podman completion zsh >~/.config/zsh/completions/_podman"
cask "rectangle"
cask "superwhisper"
cask "utm" # Troubleshooting: Use "Emulated VLAN" instead of "Shared Network" - see https://github.com/utmapp/UTM/issues/3802#issuecomment-1518924607

# cargo "..."

# npm "..."

uv "markitdown[all]"
uv "pyhocon"
uv "terminaltexteffects"
uv "unimatrix"
